org/sw-dev.org
#+title: Software Development

* About Software Development

  [[https://en.wikipedia.org/wiki/Software_development][Software Development]] consists of activities supporting the creation
  and maintenance of computer software.

* Processes

- [[https://martinfowler.com/bliki/TechnicalDebt.html][Technical Debt]] — short to-the-point explanation by Martin Fowler
- [[https://12factor.net/][The Twelve-Factor App]] — best-practices for building
  software-as-a-service (on [[https://en.wikipedia.org/wiki/Heroku][Heroku]]), but many principles are
  applicable for building software in general

* Anti-Patterns

- [[https://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/][Falsehoods Programmers Believe About Names]] — wrong assumptions
  regarding people's names
- [[https://gist.github.com/timvisee/fcda9bbdff88d45cc9061606b4b923ca][Falsehoods programmers believe about time]] — wrong assumptions
  regarding time

* Tools

  - [[file:ado.org][Azure DevOps]]
