sw-dev.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-05 Tue 12:38 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Development</title>
<meta name="author" content="Søren Lund" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<!-- begin: html/preamble.html -->
<header>
<h1>Bookmarks</h1>
<nav>
<a href="index.html">Home</a> ❙
<a href="incoming.html">Incoming</a> ❙
<a href="about.html">About</a>
</nav>
</header>
<!-- end: html/preamble.html -->
</div>
<div id="content" class="content">
<h1 class="title">Software Development</h1>

<div id="outline-container-org010ea36" class="outline-2">
<h2 id="org010ea36">About Software Development</h2>
<div class="outline-text-2" id="text-org010ea36">
<p>
<a href="https://en.wikipedia.org/wiki/Software_development">Software Development</a> consists of activities supporting the creation
and maintenance of computer software.
</p>
</div>
</div>

<div id="outline-container-orgb7d9451" class="outline-2">
<h2 id="orgb7d9451">Processes</h2>
<div class="outline-text-2" id="text-orgb7d9451">
<ul class="org-ul">
<li><a href="https://martinfowler.com/bliki/TechnicalDebt.html">Technical Debt</a> — short to-the-point explanation by Martin Fowler</li>
<li><a href="https://12factor.net/">The Twelve-Factor App</a> — best-practices for building
software-as-a-service (on <a href="https://en.wikipedia.org/wiki/Heroku">Heroku</a>), but many principles are
applicable for building software in general</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6e4cbd" class="outline-2">
<h2 id="orgf6e4cbd">Anti-Patterns</h2>
<div class="outline-text-2" id="text-orgf6e4cbd">
<ul class="org-ul">
<li><a href="https://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/">Falsehoods Programmers Believe About Names</a> — wrong assumptions
regarding people's names</li>
<li><a href="https://gist.github.com/timvisee/fcda9bbdff88d45cc9061606b4b923ca">Falsehoods programmers believe about time</a> — wrong assumptions
regarding time</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf71a8c" class="outline-2">
<h2 id="orgcf71a8c">Tools</h2>
<div class="outline-text-2" id="text-orgcf71a8c">
<ul class="org-ul">
<li><a href="ado.html">Azure DevOps</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
<p>&copy; 2021 Søren Lund</p>
</footer>
</div>
</body>
</html>
